run/pitzDaily_kOmegaSST_HR/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.3;

deltaT          0.0001;

writeControl    adjustable;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           3;


// ************************************************************************* //
libs ("libIncompressibleTurbulenceModels_mod");


functions
{
    fieldAverage1
    {
        type            turbulenceFields;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;

        fields          (R L);
        //field R;
    }
    
    yPlus1
    {
	    // Mandatory entries (unmodifiable)
	    type            yPlus;
	    libs            (fieldFunctionObjects);

	    // Optional (inherited) entries
	    writeControl    writeTime;
     }
}
