run/pitzDaily_kOmegaSST_HR/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       25468;
    }
    outlet
    {
        type            patch;
        nFaces          57;
        startFace       25498;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          245;
        startFace       25555;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          272;
        startFace       25800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          25770;
        startFace       26072;
    }
)

// ************************************************************************* //
